# Ruby, Ruby, Ruby

# Ruby — динамический, строго типизированный язык с глубоким уклоном 
# в объектно-ориентированную и функциональную парадигму программирования.

# Строгая типизация, число нельзя умножить на строку
# 4 * 'hexlet' # TypeError (String can't be coerced into Integer)
# Всё объекты
puts 1.8.round 
# Функции высшего порядка
puts ['one', 'two'].map(&:upcase) # ["ONE", "TWO"]

puts '-' * 100

# Он обладает местами непривычным, но невероятно выразительным синтаксисом. 
# Благодаря этому код на Ruby читается как английский язык и при этом остаётся компактным.

# В Ruby очень много метапрограммирования, встроенного во все части языка. Это значит, 
# что программа может менять свое поведение прямо во время работы практически в любую сторону.

